const pactTitle = "用户协议";
const privacyTitle = "隐私政策";
const pactContent = '''
请您本产品之前，请务必仔细阅读并理解《用户许可使用协议》（以下简称“本协议”）中规定的多有权利和限制。

我们一向尊重并会严格保护用户在使用本产品时的合法权益（包括用户隐私、用户数据等）不受到任何侵犯。

本协议（包括本文最后部分的隐私政策）是用户（包括通过各种合法途径获取到本产品的自然人、法人或其他组织机构，以下简称“用户”或“您”）与我们之间针对本产品相关事项最终的、完整的且排他的协议，并取代、合并之前的当事人之间关于上述事项的讨论和协议。

本协议将对用户使用本产品的行为产生法律约束力，您已承诺和保证有权利和能力订立本协议。用户开始使用本产品将视为已经接受本协议，请认真阅读并理解本协议中各种条款，包括免除和限制我们的免责条款和对用户的权利限制（未成年人审阅时应由法定监护人陪同），如果您不能接受本协议中的全部条款，请勿开始使用本产品。

使用账户
您必须承诺和保证：

1. 您使用本产品的行为必须合法

本产品将会依据本协议“修改和终止”的规定保留或终止您的账户。您必须承诺对您的登录信息保密、不被其他人获取与使用，并且对您在本账户下的所有行为负责。您必须将任何有可能触犯法律的、未授权使用或怀疑为未授权使用的行为在第一时间通知本产品。本产品不对您因未能遵守上述要求而造成的损失承担法律责任。

终端用户协议许可
依据本协议规定，本产品将授予您以下不可转让的、非排他的许可：

1.使用本产品的权利；

2.在您所有的网络通信设备、计算机设备和移动通信设备上下载、安装、使用本产品的权利。

限制性条款
本协议对您的授权将受到以下限制：

1. 您不得对本产品进行任何形式的许可、出售、租赁、转让、发行或其他商业用途；

2. 除非法律禁止此类限制，否则您不得对本产品的任何部分或衍生产品进行修改、翻译、改编、合并、利用、分解、改造或反向编译、反向工程等；

3. 您不得以创建相同或竞争服务为目的使用本产品；

4. 除非法律明文规定，否则您不得对本产品的任何部分以任何形式或方法进行生产、复制、发行、出售、下载或显示等；

5. 您不得删除或破坏包含在本产品中的任何版权声明或其他所有权标记。

费用
本软件为免费软件，任何人都可免费使用本软件，但其他增值服务需按照对应价格付费使用。

版本
任何本产品的更新版本或未来版本、更新或者其他变更将受到本协议约束。

遵守法律
您同意遵守《中华人民共和国合同法》、《中华人民共和国著作权法》及其实施条例、《全国人民代表大会常务委员会关于维护互联网安全的决定》（“人大安全决定”）、《中华人民共和国保守国家秘密法》、《中华人民共和国电信条例》（“电信条例“）、《中华人民共和国计算机信息系统安全保护条例》、《中华人民共和国计算机信息网络国际联网管理暂行规定》及其实施办法、《计算机信息系统国际联网保密管理规定》、《互联网信息服务管理办法》、《计算机信息网络国际联网安全保护管理办法》、《互联网电子公告服务管理规定》（“电子公告规定”）等相关中国法律法规的任何及所有的规定，并对以任何方式使用您的密码和您的账号使用本服务的任何行为及其结果承担全部责任。如违反《人大安全决定》有可能构成犯罪，被追究刑事责任。《电子公告规定》则有明文规定，上网用户使用电子公告服务系统对所发布的信息负责。《电信条例》也强调，使用电信网络传输信息的内容及其后果由电信用户负责。在任何情况下，如果本网站有理由认为您的任何行为，包括但不限于您的任何言论和其它行为违反或可能违反上述法律和法规的任何规定，本网站可在任何时候不经任何事先通知终止向您提供服务。

用户内容
1.用户内容是指该用户下载、发布或以其他方式使用本产品时产生的所有内容（例如：您的信息、图片、音乐或其他内容）。

2.您是您的用户内容唯一的责任人，您将承担因您的用户内容披露而导致的您或任何第三方被识别的风险。

3.您已同意您的用户内容受到权利限制（详见“权利限制”）

权利限制
您已同意通过分享或其他方式使用本产品中的相关服务，在使用过程中，您将承担因下述行为所造成的风险而产生的全部法律责任：

1.破坏宪法所确定的基本原则的；

2.危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一的；

3.损害国家荣誉和利益的；

4.煽动民族仇恨、民族歧视，破坏民族团结的；

5.破坏国家宗教政策，宣扬邪教和封建迷信的；

6.散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；

7.侮辱或者诽谤他人，侵害他人合法权益的；

8.含有法律、行政法规禁止的其他内容的。

您已经同意不在本产品从事下列行为：

1.发布或分享电脑病毒、蠕虫、恶意代码、故意破坏或改变计算机系统或数据的软件；

2.未授权的情况下，收集其他用户的信息或数据，例如电子邮箱地址等；

3.用自动化的方式恶意使用本产品，给服务器造成过度的负担或以其他方式干扰或损害网站服务器和网络链接；

4.在未授权的情况下，尝试访问本产品的服务器数据或通信数据；

5.干扰、破坏本产品其他用户的使用。

修改和终止
修改
本协议容许变更。如果本协议有任何实质性变更，我们将通过电子邮件来通知您。变更通知之后，继续使用本产品则为您已知晓此类变更并同意条款约束；

我们保留在任何时候无需通知而修改、保留或关闭本产品任何服务之权利；

您已同意我们无需因修改、保留或关闭本产品任何服务之权利；

您已同意我们无需因修改、保留或关闭本产品任何服务的行为对您或第三方承担责任。

终止
本协议自您接受之日起生效，在您使用本产品的过程中持续有效，直至依据本协议终止；

尽管有上述规定，如果您使用本产品的时间早于您接受本协议的时间，您在此知晓并同意本协议于您接受本协议的时间，您在此知晓并同意本协议于您第一次使用本产品时生效，除非依据本协议提前终止；

我们可能会依据法律的规定，保留您使用本产品或者本账户的权利；无论是否通知，我们将在任何时间以任何原因终止本协议，包括出于善意的相信您违反了我们可接受使用政策或本协议的其他规定；

不受前款规定所限，如果用户侵犯第三人的版权且我们接到版权所有人或版权所有人的合法代理人的通知后，我们保留终止本协议的权利；

一旦本协议终止，您使用本产品的权利即告终止。您应当知晓您的产品终止意味着您的用户内容将从我们的活动数据库中删除。我们不因终止本协议对您承担任何责任，包括终止您的用户账户和删除您的用户内容。

第三方
您已知晓或同意我们的部分服务时基于第三方的技术支持获得；

您已知晓本协议是您在与我们之前签订，而非您与上述第三方之间签订。我们是基于本产品所产生的内容、维护、支持服务、保证和由此产生的诉讼等事项的唯一责任人。您已同意遵守且授权给本产品限制您有条件地使用本产品的服务。

第三方信息和服务
1.本产品包含了第三方的部分信息和服务。我们不控制且不对第三方的信息和服务负责；

2.我们仅为您使用方便的目的或为承诺和保证第三方的需要而提供此类信息和服务；

3.用户需对使用第三方信息和服务产生的风险承担法律责任；

4.当用户访问第三方信息和服务时，适用第三方的条款和政策。

赔偿
您已同意无害地使用本产品，避免因下述行为或相关行为遭受来第三方的任何投诉、诉讼、损失、损害、责任、成本和费用（包括律师费）：

1.用户使用本产品的行为；

2.用户的用户内容；

3.用户违反本协议的行为。

我们保留专属抗辩权和请求赔偿的权利

您已同意，除非获得我们书面同意，您不得在您与我们共同对第三方提起的诉讼中单方和解。

我们将尽合理努力将此类诉讼、诉讼行为或进程通知您。

在任何情况下，本产品都不对您或任何第三方因本协议产生的任何间接性、后果性、惩罚性的、偶然的、特殊或惩罚性的损害赔偿承担责任。访问、使用本产品所产生的损坏计算机系统或移动通讯设备数据的风险将由您个人承担。

适用法律
本协议适用中华人民共和国法律；

如果双方发生纠纷，应本着友好的圆柱协商解决；如协商不成，应向所在地的法院提起诉讼。

独立性
本协议中的某些条款因故无法适用，则本协议的其他条款继续适用且无法适用的条款将会被修改，以便其能够依法适用。

完整性
本协议（包括隐私政策）是您和本产品之间关于本产品相关事项的最终的、完整的、排他的协议，且取代和合并之前当事人关于此类事项（包括之前的最终用户许可、服务条款和隐私政策）的讨论和协议；

每部分的题目只为阅读之便而无任何法律或合同义务；

除非我们书面同意，您不得转让本协议所规定的权利义务。任何违反上述规定企图转让的行为均无效。
''';
const privacyContent = '''本政策仅适用于上海晨凝信息技术有限公司产品或服务。 
最近更新日期：2021年4月20日
本政策将帮助您了解以下内容：
一、我们如何收集和使用您的用户信息
二、我们如何使用 Cookie 和同类技术
三、我们如何共享、转让、公开披露您的用户信息
四、我们如何保护您的用户信息
五、您的权利
六、我们如何处理儿童的个人信息
七、您的用户信息如何储存及如何在全球范围转移
八、本政策如何更新
九、如何联系我们

我们深知用户信息对您的重要性，并会尽全力保护您的用户信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的用户信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的用户信息。
请在使用我们的产品（或服务）前，仔细阅读并了解本隐私政策。

一、我们如何收集和使用您的用户信息
（一）您使用我司产品或服务过程中我们收集和使用的信息
我们仅会出于本政策所述的业务功能，收集和使用您的用户信息，收集用户信息的目的在于向您提供产品或服务，您有权自行选择是否提供该信息，但多数情况下，如果您不提供，我们可能无法向您提供相应的服务，也无法回应您遇到的问题。
我们保证会依法对收集后的用户信息进行去标识化或匿名化处理，对于无法单独或者与其他信息结合识别自然人个人身份的信息，不属于法律意义上的个人信息。如果我们将非个人信息与其他信息结合识别到您的个人身份时，或者与您的个人信息结合使用时，我们会在结合使用期间，将此类信息作为您的个人信息按照本隐私政策对其进行处理和保护。
为了更好运营和改善我们的技术和服务，或出于商业策略的变化，当我们提供的产品或服务所需的用户信息收集、使用、处理超出上述范围或者要将收集到的用户信息用于本隐私政策未载明的其他用途，或当我们要将基于特定目的收集而来的信息用于其他目的时，我们会在获取用户信息后的合理期限内或处理用户信息前通知您，并获得您的授权同意。

（二）征得授权同意的例外
请您理解，根据法律法规及相关国家标准，以下情形中，我们收集和使用您的用户信息无需征得您的授权同意： 
1、与国家安全、国防安全直接相关的； 
2、与公共安全、公共卫生、重大公共利益直接相关的； 
3、与犯罪侦查、起诉、审判和判决执行等直接相关的； 
4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的； 
5、所收集的您的用户信息是您自行向社会公众公开的；
6、从合法公开披露的信息中收集的您的用户信息，如合法的新闻报道、政府信息公开等渠道； 
7、根据您的要求签订或履行合同所必需的； 
8、用于维护软件及相关服务的安全稳定运行所必需的，例如发现、处置软件及相关服务的故障；
9、 个人信息控制者为新闻单位且其在开展合法的新闻报道所必需的； 
10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的。
11、法律法规规定的其他情形。

二、我们如何使用 Cookie 和同类技术
（一）Cookie
为确保网站正常运转，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。借助于 Cookie，网站能够存储您的访问偏好数据。
我们不会将 Cookie 用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookie。您可以清除计算机上保存的所有 Cookie，大部分网络浏览器都设有阻止Cookie 的功能。但如果您这么做，则需要在每一次访问我们的网站时亲自更改用户设置。

（二）网站信标和像素标签
除 Cookie 外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的点击URL。
如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。

（三）Do Not Track（请勿追踪）
很多网络浏览器均设有Do Not Track功能，该功能可向网站发布Do Not Track请求。目前，主要互联网标准组织尚未设立相关政策来规定网站应如何应对此类请求。但如果您的浏览器启用了 Do Not Track，那么我们的所有网站都会尊重您的选择。

三、我们如何共享、转让、公开披露您的用户信息
（一）共享
我们不会与其他的任何公司、组织和个人分享您的用户信息，但以下情况除外：
1、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的用户信息。
2、我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的用户信息。
3、与我们的关联公司共享：您的用户信息可能会与我们的关联公司共享。我们只会共享必要的用户信息，且受本隐私政策中所声明目的的约束。关联公司如要改变用户信息的处理目的，将再次征求您的授权同意。
4、与授权合作伙伴共享：仅为实现本政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些用户信息，以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的用户信息，并且只会共享提供服务所必要的用户信息。为了更好运营和改善技术和服务，您同意我们和授权合作伙伴在符合相关法律法规的前提下可将收集的信息用于其他服务和用途。
以下列举了具体的授权合作伙伴，并提供了该第三方的隐私政策链接，我们建议您阅读该第三方的隐私政策：
（1）我们的服务由第三方合作伙伴【如极光】提供，在提供该等服务的过程中，第三方合作伙伴需要收集您的相关个人信息，包括设备信息[ 设备信息包括：设备标识符（IMEI、IDFA、Android ID、MAC、OAID等相关信息）、应用信息（应用崩溃信息、通知开关状态、软件列表等相关信息）、设备参数及系统信息（设备类型、设备型号、操作系统及硬件相关信息）]、网络信息[ 网络信息包括：IP地址，WiFi信息，基站信息等相关信息。 ]、地理位置信息。为向您提供更好的服务、改善技术和提升用户体验，您理解并同意，我们有权在必要范围内向第三方合作伙伴提供您的个人信息，且第三方合作伙伴亦可以基于前述目的自行收集和使用您的个人信息，并在保护您个人信息和隐私权以及符合适用法律法规的前提下，将收集的信息和数据经去标识化或匿名化处理后用于其他服务和用途。当我们要将个人信息用于本政策未载明的其它用途时，会事先通知您并征求您的同意。当我们要将基于特定目的收集而来的信息用于其他目的时，也会事先通知您并并征求您的同意。
（2）广告、媒体：我们可能会将收集到的信息共享给广告、媒体以及我们的其他授权合作伙伴，用于包括优化广告投放和提升营销效果等商业化用途。
对我们与之共享用户信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理用户信息。

（二）转让
我们不会将您的用户信息转让给任何公司、组织和个人，但以下情况除外：
1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的用户信息；
2、在涉及合并、收购或破产清算时，如涉及到用户信息转让，我们会再要求新的持有您用户信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。

（三）公开披露
我们仅会在以下情况下，公开披露您的用户信息：
1、获得您明确同意后；
2、基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的用户信息。

（四）共享、转让、公开披露信息时事先征得授权同意的例外
请您理解，根据法律法规及相关国家标准，以下情形中，我们共享、转让、公开披露您的用户信息无需征得您的授权同意：
1、与国家安全、国防安全直接相关的； 
2、与公共安全、公共卫生、重大公共利益直接相关的； 
3、与犯罪侦查、起诉、审判和判决执行等直接相关的； 
4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的； 
5、您自行向社会公众公开的信息； 
6、从合法公开披露的信息中收集的，如合法的新闻报道、政府信息公开等渠道。

四、我们如何保护您的用户信息
（一）我们已使用符合业界标准的安全防护措施保护您提供的用户信息，防止数据遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的用户信息。例如，在您的浏览器与“服务”之间交换数据时受 SSL 加密保护；我们同时对网站提供https安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问用户信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护用户信息重要性的认识。
（二）我们会采取一切合理可行的措施，确保未收集无关的用户信息。我们只会在达成本政策所述目的所需的期限内保留您的用户信息，除非需要延长保留期或受到法律的允许。
（三）互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送用户信息。
（四）我们将定期更新并公开安全风险、用户信息安全影响评估等报告的有关内容。互联网环境并非百分之百安全，我们将尽力确保您发送给我们的任何信息的安全性。即使我们做出了很大努力，采取了一切合理且必要的措施，仍然有可能无法杜绝您的用户信息被非法访问、被非法盗取，被非法篡改或毁坏，导致您的合法权益受损，请您理解信息网络的上述风险并自愿承担。
（五）在不幸发生用户信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知用户信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报用户信息安全事件的处置情况。

五、您的权利
按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的用户信息行使以下权利：
（一）访问您的用户信息
您有权访问您的用户信息，法律法规规定的例外情况除外。
如果您无法通过上述链接访问这些用户信息，您可以随时使用我们的 Web 表单联系，或发送电子邮件至47718946@qq,com。我们将在30天内回复您的访问请求。
对于您在使用我们的产品或服务过程中产生的其他用户信息，只要我们不需要过多投入，我们会向您提供。如果您想行使数据访问权，请发送电子邮件至47718946@qq,com。

（二）更正您的用户信息
当您发现我们处理的关于您的用户信息有错误时，您有权要求我们作出更正。您可以通过“（一）访问您的用户信息”中罗列的方式提出更正申请。 如果您无法通过上述链接更正这些用户信息，您可以随时使用我们的 Web 表单联系，或发送电子邮件至47718946@qq,com。我们将在30天内回复您的更正请求。

（三）删除您的用户信息
在以下情形中，您可以向我们提出删除用户信息的请求：
1、如果我们处理用户信息的行为违反法律法规；
2、如果我们收集、使用您的用户信息，却未征得您的同意；
3、如果我们处理用户信息的行为违反了与您的约定；
4、如果您不再使用我们的产品或服务，或您注销了账号；
5、如果我们不再为您提供产品或服务。
我们将会根据您的删除请求进行评估，若满足相应规定，我们将会采取相应步骤进行处理。当您向我们提出删除请求时，我们可能会要求您进行身份验证，以保障账户的安全。当您从我们的服务中删除信息后，因为适用的法律和安全技术，我们可能不会立即从备份系统中删除相应的信息，我们将安全存储您的信息直到备份可以清除或实现匿名化。

（四）改变您授权同意的范围
每个业务功能需要一些基本的用户信息才能得以完成（见本政策“第一部分”）。对于用户信息的收集和使用，您可以随时给予或收回您的授权同意。
当您收回同意后，我们将不再处理相应的用户信息。同时也请您注意，您撤销授权同意可能会导致某些后果，例如我们可能无法继续为您提供相应的服务或特定的功能，但您收回同意的决定，不会影响此前基于您的授权而开展的用户信息处理。

在注销账户之后，我们将停止为您提供产品或服务并依据您的要求，删除或匿名化您的信息，法律法规另有规定的除外。这也将可能导致您失去对您账户中数据的访问权，请您谨慎操作。

（五）用户信息主体获取用户信息副本
您有权获取您的用户信息副本，您可以通过以下方式自行操作：发送申请邮件至47718946@qq,com，我们将在30天内回复您
在技术可行的前提下，例如数据接口匹配，我们还可按您的要求，直接将您的用户信息副本传输给您指定的第三方。

（六）约束信息系统自动决策
在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制作出决定。如果这些决定显著影响您的合法权益，您有权要求我们作出解释，我们也将提供适当的救济方式。

（七）响应您的上述请求
为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。
对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际的请求，我们可能会予以拒绝。也请您理解，出于安全保障的考虑、相关法律法规的要求或技术上的限制，对于您的某些请求我们可能无法做出响应，例如以下情形：
1、与用户信息控制者履行法律法规规定的义务相关的；
2、与国家安全、国防安全直接相关的；
3、与公共安全、公共卫生、重大公共利益直接相关的；
4、与犯罪侦查、起诉、审判和执行判决等直接相关的；
5、用户信息控制者有充分证据表明用户信息主体存在主观恶意或滥用权利的；
6、出于维护用户信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
7、响应用户信息主体的请求将导致用户信息主体或其他个人、组织的合法权益受到严重损害的； 
8、涉及商业秘密的。
七、本政策如何更新
我们的隐私政策可能变更。未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。我们会在本页面上发布对本政策所做的任何变更。
对于重大变更，我们还会提供更为显著的通知。本政策所指的重大变更包括但不限于：
1、我们的服务模式发生重大变化。如处理用户信息的目的、处理的用户信息类型、用户信息的使用方式等；
2、我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
3、用户信息共享、转让或公开披露的主要对象发生变化；
4、您参与用户信息处理方面的权利及其行使方式发生重大变化；
5、我们负责处理用户信息安全的责任部门、联络方式及投诉渠道发生变化时；
6、用户信息安全影响评估报告表明存在高风险时。
我们还会将本政策的旧版本存档，供您查阅。

八、如何联系我们
如果您对本隐私政策有任何疑问、意见或建议，通过以下方式与我们联系：
电子邮件：47718946@qq.com
一般情况下，我们将在三十天内回复。
''';
